WebService/wsmtxca

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://impl.service.wsmtxca.afip.gov.ar/service/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:autorizarComprobanteRequest>
         <authRequest>
<token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgdW5pcXVlX2lkPSIzOTMyNjQyOTI4IiBnZW5fdGltZT0iMTcyMTY2ODMyMyIgZXhwX3RpbWU9IjE3MjE3MTE1ODMiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NtdHhjYSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDI3NzI5MjMyOCwgQ049Y2VzYXJ2aWMiIGF1dGhtZXRob2Q9ImNtcyIgcmVnbWV0aG9kPSIyMiI+CiAgICAgICAgICAgIDxyZWxhdGlvbnM+CiAgICAgICAgICAgICAgICA8cmVsYXRpb24ga2V5PSIzMDY3NjE3NTE3OSIgcmVsdHlwZT0iNCIvPgogICAgICAgICAgICA8L3JlbGF0aW9ucz4KICAgICAgICA8L2xvZ2luPgogICAgPC9vcGVyYXRpb24+Cjwvc3NvPgo=</token>
            <sign>LSLIjylJCn6hbov+l8F/eo7A+3GfHGxlLfcF9QY/GH0voZkPnt5SaY8J9rABLkQ9VHmRKEqagYq4vLBlvU425UNPEeSU5b1SzrsmAYVUDojvDeiQvqL/pppXujz1HVdg2LWlNkkMUvNhLVX34qtNY3u0GelH9ATCSasK4O9dobk=</sign>
            <cuitRepresentada>30676175179</cuitRepresentada>
         </authRequest>
         <comprobanteCAERequest>
            <codigoTipoComprobante>1</codigoTipoComprobante>
            <numeroPuntoVenta>1</numeroPuntoVenta>
            <numeroComprobante>1</numeroComprobante>
            <codigoTipoDocumento>80</codigoTipoDocumento>
            <numeroDocumento>30707439773</numeroDocumento>
            <importeSubtotal>1000</importeSubtotal>
            <importeTotal>1000</importeTotal>
            <codigoMoneda>PES</codigoMoneda>
            <cotizacionMoneda>1</cotizacionMoneda>
            <codigoConcepto>1</codigoConcepto>
            <arrayComprobantesAsociados>
               <!--1 or more repetitions:-->
               <comprobanteAsociado>
                  <codigoTipoComprobante>91</codigoTipoComprobante>
                  <numeroPuntoVenta>1</numeroPuntoVenta>
                  <numeroComprobante>1</numeroComprobante>
               </comprobanteAsociado>
            </arrayComprobantesAsociados>
            <arrayItems>
               <item>
                  <unidadesMtx>7</unidadesMtx>
                  <codigo>1</codigo>
                  <descripcion>CAJA 1</descripcion>
                  <cantidad>10</cantidad>
                  <codigoUnidadMedida>1</codigoUnidadMedida>
                  <precioUnitario>100</precioUnitario>
                  <codigoCondicionIVA>1</codigoCondicionIVA>
                  <importeItem>100</importeItem>
               </item>
            </arrayItems>
            <arrayActividades>
               <!--1 or more repetitions:-->
               <actividad>
                  <codigo>476130</codigo>
               </actividad>
            </arrayActividades>
         </comprobanteCAERequest>
      </ser:autorizarComprobanteRequest>
   </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://impl.service.wsmtxca.afip.gov.ar/service/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:autorizarComprobanteRequest>
         <authRequest>
<token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgdW5pcXVlX2lkPSIzOTMyNjQyOTI4IiBnZW5fdGltZT0iMTcyMTY2ODMyMyIgZXhwX3RpbWU9IjE3MjE3MTE1ODMiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NtdHhjYSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDI3NzI5MjMyOCwgQ049Y2VzYXJ2aWMiIGF1dGhtZXRob2Q9ImNtcyIgcmVnbWV0aG9kPSIyMiI+CiAgICAgICAgICAgIDxyZWxhdGlvbnM+CiAgICAgICAgICAgICAgICA8cmVsYXRpb24ga2V5PSIzMDY3NjE3NTE3OSIgcmVsdHlwZT0iNCIvPgogICAgICAgICAgICA8L3JlbGF0aW9ucz4KICAgICAgICA8L2xvZ2luPgogICAgPC9vcGVyYXRpb24+Cjwvc3NvPgo=</token>
            <sign>LSLIjylJCn6hbov+l8F/eo7A+3GfHGxlLfcF9QY/GH0voZkPnt5SaY8J9rABLkQ9VHmRKEqagYq4vLBlvU425UNPEeSU5b1SzrsmAYVUDojvDeiQvqL/pppXujz1HVdg2LWlNkkMUvNhLVX34qtNY3u0GelH9ATCSasK4O9dobk=</sign>
            <cuitRepresentada>30676175179</cuitRepresentada>
         </authRequest>
         <comprobanteCAERequest>
            <codigoTipoComprobante>1</codigoTipoComprobante>
            <numeroPuntoVenta>1</numeroPuntoVenta>
            <numeroComprobante>1</numeroComprobante>
            <!--Optional:-->
            <fechaEmision>?</fechaEmision>
            <!--Optional:-->
            <codigoTipoAutorizacion>?</codigoTipoAutorizacion>
            <!--Optional:-->
            <codigoAutorizacion>?</codigoAutorizacion>
            <!--Optional:-->
            <fechaVencimiento>?</fechaVencimiento>
            <!--Optional:-->
            <codigoTipoDocumento>80</codigoTipoDocumento>
            <!--Optional:-->
            <numeroDocumento>30707439773</numeroDocumento>
            <!--Optional:-->
            <importeGravado>?</importeGravado>
            <!--Optional:-->
            <importeNoGravado>?</importeNoGravado>
            <!--Optional:-->
            <importeExento>?</importeExento>
            <importeSubtotal>1000</importeSubtotal>
            <!--Optional:-->
            <importeOtrosTributos>?</importeOtrosTributos>
            <importeTotal>1000</importeTotal>
            <codigoMoneda>PES</codigoMoneda>
            <cotizacionMoneda>1</cotizacionMoneda>
            <!--Optional:-->
            <observaciones>?</observaciones>
            <codigoConcepto>1</codigoConcepto>
            <!--Optional:-->
            <fechaServicioDesde>?</fechaServicioDesde>
            <!--Optional:-->
            <fechaServicioHasta>?</fechaServicioHasta>
            <!--Optional:-->
            <fechaVencimientoPago>?</fechaVencimientoPago>
            <!--Optional:-->
            <fechaHoraGen>?</fechaHoraGen>
            <!--Optional:-->
            <arrayComprobantesAsociados>
               <!--1 or more repetitions:-->
               <comprobanteAsociado>
                  <codigoTipoComprobante>91</codigoTipoComprobante>
                  <numeroPuntoVenta>1</numeroPuntoVenta>
                  <numeroComprobante>1</numeroComprobante>
                  <!--Optional:-->
                  <cuit>?</cuit>
                  <!--Optional:-->
                  <fechaEmision>?</fechaEmision>
               </comprobanteAsociado>
            </arrayComprobantesAsociados>
            <!--Optional:-->
            <periodoComprobantesAsociados>
               <fechaDesde>?</fechaDesde>
               <fechaHasta>?</fechaHasta>
            </periodoComprobantesAsociados>
            <!--Optional:-->
            <arrayOtrosTributos>
               <!--1 or more repetitions:-->
               <otroTributo>
                  <codigo>?</codigo>
                  <!--Optional:-->
                  <descripcion>?</descripcion>
                  <baseImponible>?</baseImponible>
                  <importe>?</importe>
               </otroTributo>
            </arrayOtrosTributos>
            <arrayItems>
               <!--1 or more repetitions:-->
               <item>
                  <!--Optional:-->
                  <unidadesMtx>7</unidadesMtx>
                  <!--Optional:-->
                  <codigoMtx>1</codigoMtx>
                  <!--Optional:-->
                  <codigo>1</codigo>
                  <descripcion>CAJA 1</descripcion>
                  <!--Optional:-->
                  <cantidad>10</cantidad>
                  <codigoUnidadMedida>1</codigoUnidadMedida>
                  <!--Optional:-->
                  <precioUnitario>100</precioUnitario>
                  <!--Optional:-->
                  <importeBonificacion>?</importeBonificacion>
                  <codigoCondicionIVA>1</codigoCondicionIVA>
                  <!--Optional:-->
                  <importeIVA>?</importeIVA>
                  <importeItem>100</importeItem>
               </item>
            </arrayItems>
            <!--Optional:-->
            <arraySubtotalesIVA>
               <!--1 or more repetitions:-->
               <subtotalIVA>
                  <codigo>?</codigo>
                  <importe>?</importe>
               </subtotalIVA>
            </arraySubtotalesIVA>
            <!--Optional:-->
            <arrayDatosAdicionales>
               <!--1 or more repetitions:-->
               <datoAdicional>
                  <t>?</t>
                  <!--Optional:-->
                  <c1>?</c1>
                  <!--Optional:-->
                  <c2>?</c2>
                  <!--Optional:-->
                  <c3>?</c3>
                  <!--Optional:-->
                  <c4>?</c4>
                  <!--Optional:-->
                  <c5>?</c5>
                  <!--Optional:-->
                  <c6>?</c6>
               </datoAdicional>
            </arrayDatosAdicionales>
            <!--Optional:-->
            <arrayCompradores>
               <!--1 or more repetitions:-->
               <comprador>
                  <codigoTipoDocumento>?</codigoTipoDocumento>
                  <numeroDocumento>?</numeroDocumento>
                  <porcentaje>?</porcentaje>
               </comprador>
            </arrayCompradores>
            <!--Optional:-->
            <arrayActividades>
               <!--1 or more repetitions:-->
               <actividad>
                  <codigo>476130</codigo>
               </actividad>
            </arrayActividades>
         </comprobanteCAERequest>
      </ser:autorizarComprobanteRequest>
   </soapenv:Body>
</soapenv:Envelope>



<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <ns1:consultarUnidadesMedidaResponse xmlns:ns1="http://impl.service.wsmtxca.afip.gov.ar/service/">
         <arrayUnidadesMedida>
            <codigoDescripcion>
               <codigo>41</codigo>
               <descripcion>miligramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>14</codigo>
               <descripcion>gramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>1</codigo>
               <descripcion>kilogramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>29</codigo>
               <descripcion>toneladas</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>10</codigo>
               <descripcion>quilates</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>47</codigo>
               <descripcion>mililitros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>5</codigo>
               <descripcion>litros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>27</codigo>
               <descripcion>cm cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>15</codigo>
               <descripcion>milimetros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>20</codigo>
               <descripcion>centímetros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>17</codigo>
               <descripcion>kilómetros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>7</codigo>
               <descripcion>unidades</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>8</codigo>
               <descripcion>pares</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>9</codigo>
               <descripcion>docenas</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>11</codigo>
               <descripcion>millares</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>96</codigo>
               <descripcion>packs</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>2</codigo>
               <descripcion>metros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>3</codigo>
               <descripcion>metros cuadrados</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>4</codigo>
               <descripcion>metros cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>6</codigo>
               <descripcion>1000 kWh</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>16</codigo>
               <descripcion>mm cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>18</codigo>
               <descripcion>hectolitros</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>25</codigo>
               <descripcion>jgo. pqt. mazo naipes</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>30</codigo>
               <descripcion>dam cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>31</codigo>
               <descripcion>hm cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>32</codigo>
               <descripcion>km cúbicos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>33</codigo>
               <descripcion>microgramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>34</codigo>
               <descripcion>nanogramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>35</codigo>
               <descripcion>picogramos</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>48</codigo>
               <descripcion>curie</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>49</codigo>
               <descripcion>milicurie</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>50</codigo>
               <descripcion>microcurie</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>51</codigo>
               <descripcion>uiacthor</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>52</codigo>
               <descripcion>muiacthor</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>53</codigo>
               <descripcion>kg base</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>54</codigo>
               <descripcion>gruesa</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>61</codigo>
               <descripcion>kg bruto</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>62</codigo>
               <descripcion>uiactant</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>63</codigo>
               <descripcion>muiactant</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>64</codigo>
               <descripcion>uiactig</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>65</codigo>
               <descripcion>muiactig</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>66</codigo>
               <descripcion>kg activo</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>67</codigo>
               <descripcion>gramo activo</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>68</codigo>
               <descripcion>gramo base</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>98</codigo>
               <descripcion>otras unidades</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>95</codigo>
               <descripcion>anulación/devolución</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>97</codigo>
               <descripcion>seña/anticipo</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>99</codigo>
               <descripcion>bonificación</descripcion>
            </codigoDescripcion>
            <codigoDescripcion>
               <codigo>0</codigo>
               <descripcion></descripcion>
            </codigoDescripcion>
         </arrayUnidadesMedida>
      </ns1:consultarUnidadesMedidaResponse>
   </soapenv:Body>
</soapenv:Envelope>